export const mockUser = {
    "email": "pochta@yandex.ru",
    "login": "ivanivanov",
    "fistName": "Иван",
    "secondName": "Иванов",
    "phone": "+7 (909) 967 30 30",
    "password": "ivanivanov",
    "repeatPassword": "ivaivanov",
};

export const mockChats = [
    {
        id: 0,
        withUser: "Андрей",
        islastMessageToUser: true,
        lastMessage: "Изображение",
        dateTime: "10:49",
        countUnreadMessage: 2,
        chat: [
            {
                content: "Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. ",
                isToUser: true,
                time: "11:56",
            },
            {
                content: "Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.",
                isToUser: true,
                time: "11:56",
            },
            {
                content: "Круто!",
                isToUser: false,
                time: "12:00",
            }

        ],
    },
    {
        id: 1,
        withUser: "Киноклуб",
        islastMessageToUser: false,
        lastMessage: "Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!",
        dateTime: "12:00",
        chat: [
            {
                content: "Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. ",
                isToUser: true,
                time: "11:56",
            },
            {
                content: "Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.",
                isToUser: true,
                time: "11:56",
            },
            {
                content: "Круто!",
                isToUser: false,
                time: "12:00",
            }

        ],
    },
    {
        id: 2,
        withUser: "Андрей",
        islastMessageToUser: true,
        lastMessage: "Круто!",
        dateTime: "Пт",
        countUnreadMessage: 4,
        chat: [
            {
                content: "Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. ",
                isToUser: true,
                time: "11:56",
            },
            {
                content: "Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.",
                isToUser: true,
                time: "11:56",
            },
            {
                content: "Круто!",
                isToUser: false,
                time: "12:00",
            }

        ],
    },
    {
        id: 3,
        withUser: "Андрей",
        islastMessageToUser: true,
        lastMessage: "Изображение",
        dateTime: "10:49",
        countUnreadMessage: 2,
        chat: [
            {
                content: "Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. ",
                isToUser: true,
                time: "11:56",
            },
            {
                content: "Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.",
                isToUser: true,
                time: "11:56",
            },
            {
                content: "Круто!",
                isToUser: false,
                time: "12:00",
            }

        ],
    },
    {
        id: 4,
        withUser: "Киноклуб",
        islastMessageToUser: false,
        lastMessage: "Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!",
        dateTime: "12:00",
        chat: [
            {
                content: "Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. ",
                isToUser: true,
                time: "11:56",
            },
            {
                content: "Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.",
                isToUser: true,
                time: "11:56",
            },
            {
                content: "Круто!",
                isToUser: false,
                time: "12:00",
            }

        ],
    },
    {
        id: 5,
        withUser: "Андрей",
        islastMessageToUser: true,
        lastMessage: "Круто!",
        dateTime: "Пт",
        countUnreadMessage: 4,
        chat: [
            {
                content: "Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. ",
                isToUser: true,
                time: "11:56",
            },
            {
                content: "Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.",
                isToUser: true,
                time: "11:56",
            },
            {
                content: "Круто!",
                isToUser: false,
                time: "12:00",
            }

        ],
    },
    {
        id: 6,
        withUser: "Андрей",
        islastMessageToUser: true,
        lastMessage: "Изображение",
        dateTime: "10:49",
        countUnreadMessage: 2,
        chat: [
            {
                content: "Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. ",
                isToUser: true,
                time: "11:56",
            },
            {
                content: "Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.",
                isToUser: true,
                time: "11:56",
            },
            {
                content: "Круто!",
                isToUser: false,
                time: "12:00",
            }

        ],
    },
    {
        id: 7,
        withUser: "Киноклуб",
        islastMessageToUser: false,
        lastMessage: "Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!",
        dateTime: "12:00",
        chat: [
            {
                content: "Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. ",
                isToUser: true,
                time: "11:56",
            },
            {
                content: "Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.",
                isToUser: true,
                time: "11:56",
            },
            {
                content: "Круто!",
                isToUser: false,
                time: "12:00",
            }

        ],
    },
    {
        id: 8,
        withUser: "Андрей",
        islastMessageToUser: true,
        lastMessage: "Круто!",
        dateTime: "Пт",
        countUnreadMessage: 4,
        chat: [
            {
                content: "Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. ",
                isToUser: true,
                time: "11:56",
            },
            {
                content: "Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.",
                isToUser: true,
                time: "11:56",
            },
            {
                content: "Круто!",
                isToUser: false,
                time: "12:00",
            }

        ],
    },
]; 

export const mockUserProfile=[
    {
        name: "Почта",
        value: "pochta@yandex.ru",
        inputName: "email",  
    },
    {
        name: "Логин",
        value: "ivanivanov",
        inputName: "login",  
    },
    {
        name: "Имя",
        value: "Иван",
        inputName: "first_name",  
    },
    {
        name: "Фамилия",
        value: "Иванов",
        inputName: "second_name",  
    },
    {
        name: "Имя в чате",
        value: "Иван",
        inputName: "display_name",  
    },
    {
        name: "Телефон",
        value: "+7 (909) 967 30 30",
        inputName: "phone",  
    }
];
